{
    "blogs": [
        {
            "header": "Thanks for checking in. We're currently working on the website-- please come back later!",
            "author": "Stanley Kwong",
            "team"  : "Webmaster",
            "date"  : ["2014", "6", "1"],
            "paragraphs" : [
                "We appreciate you checking out our website! However, you caught us at a bit of a bad time, because we're remaking the site! It's going to be pretty sweet, and so much better than the last one. So nothing on the website works right now. Sorry!"
            ],
            "images": []
        }
      , {
            "header": "Blocks don't matter: points do.",
            "author": "Cuyler Crandall",
            "team"  : "Engineering Lead",
            "date"  : ["2014", "8", "7"],
            "paragraphs"  : [
                "Our first season of FTC was rough around the edges but ultimately a challenging and insightful experience for our team. As a rookie team we fell victim to numerous traps in our design and building process, leading us to waste time and resources on designs which ultimately failed or never came to be. In our first robot we went for the obvious method of scoring points: lifting blocks into the baskets, while we dismissed the pull up bar as an impossibility for our new team and only gave the flag turner a brief afterthought. The robot, when “complete,” was little better than a prototype. The drive base was simple but effective, however everything piled haphazardly on top of it was laughably useless. Our block scoring mechanism was made of wood for lack of metal parts, our flag turner was a Mindstorms motor, and our robot was held together by its string suspension system. Our first competition, the FTC qualifier at Saratoga High School, we fell apart. Literally: the robot was in pieces, the competition had been Murphy’s Law at it’s finest.",
                "After the competition we were in shock, but after a few days we came to and set at work to rebuild a better robot. Over Thanksgiving break we sat in one of our team leads’ living room and decided upon major points: points were our goal as opposed to blocks, we needed more parts to have any hope of being competitive, and that accepting that our first robot had failed was important in us moving on to the next robot. In the weeks following that meeting we crunched and were able to build our second robot, just barely in time for our second qualifier at Valley Christian High School. Our second robot was the antithesis of our first: where the first had been a blind attempt to score block points, our second was a sleek, barebones robot which aimed to score as many points as we could while still allowing us to build it in under a month. Our second robot virtually ignored the baskets and blocks, aiming to score as many peripheral points as possible (50 from hanging, 35 from the flag, 20 for being on the ramp at the end of autonomous, and finally 20\/40 from a blindly dumped autonomous block).",
                "The robot was an unprecedented success, although kinks in the design held us back in the standings, we obtained the highest block scores in each competition which we competed at. Sadly, we were too little, too late and were unable to qualify for the next level of FTC competition. What we did learn from the two robots was the importance in timing, a robot which could grab all of the “difficult” points during the first qualifier would be enough to qualify for the next round, but by building it for our second competition it wasn’t enough to compete with the more complex “do-it-all” robots. Next year one of our biggest goals will be to build a robot which is designed to maximize points scored first, and only after we have that robot working will we either build a second robot or improve the first in order to address all elements of the game. Doing so should allow us to qualify for the next level of FTC, and lead to competitive season for our robots and team."
            ],
            "images": ["imgs/ftcrobot0.jpg"]
        }
      , {
            "header": "Bag and Tag Fundraiser",
            "author": "Christina Wade", 
            "team"  : "Advisor",
            "date"  : ["2014", "8", "20"],
            "paragraphs" : [
                "On February 20th, the Iron Panthers held their first annual Bag and Tag Fundraiser Dinner. We raised not only over $1000, but also awareness of and support for the team! Wow! Not too shabby for a rookie team! Guests were able to see demonstrations of both the FTC and the FRC robots, as well as watch the Chairman's Award video and Robot Release video as we unveiled the \"Deadliest Catch.\" We also presented a <a href=\"http://prezi.com/jkgenwbyud1w/burlingame-robotics-team/\">Prezi<\/a> detailing our journey thus far.",
                "<img src=\"imgs/bagandtag1.jpg\" alt=\"Dinner presentations\"><\/img>",
                "After a dinner provided by Iron Panther chefs and local businesses such as Crepevine, some guests were able to drive the FTC robot, raising the flag and hanging from the pull-up bar. Aside from Iron Panthers families and BHS teachers, major community members also attended, including Burlingame mayor Michael Brownrigg."
            ],
            "images": ["imgs/bagandtag0.jpg"]
        }
    ],
    
    "members": {
        "mentors" : [
            { "firstname": "Christina", "lastname": "Wade",     "portrait": "" },
            { "firstname": "Ian",       "lastname": "Hovander", "portrait": "" },
            { "firstname": "Parker",    "lastname": "Robinson", "portrait": "" }
        ],
        "leads": [
            { "firstname": "Sami",      "lastname": "Solow",    "portrait": ""
                , "grade": 12, "title": "Team Captain"     },
            { "firstname": "Cameron",   "lastname": "Chen",     "portrait": ""
                , "grade": 12, "title": "Team Captain"     },
            { "firstname": "Reuben",    "lastname": "Grossman", "portrait": ""
                , "grade": 11, "title": "Engineering Lead" },
            { "firstname": "Cuyler",    "lastname": "Crandall", "portrait": ""
                , "grade": 11, "title": "Engineering Lead" },
            { "firstname": "Leon",      "lastname": "Cheung",   "portrait": ""
                , "grade": 12, "title": "Programming Lead" },
            { "firstname": "Sam",       "lastname": "Shih",     "portrait": ""
                , "grade": 12, "title": "Programming Lead" },
            { "firstname": "Morgan",    "lastname": "Ome",      "portrait": ""
                , "grade": 12, "title": "Business Lead"    },
            { "firstname": "Gracie",    "lastname": "Kober",    "portrait": ""
                , "grade": 10, "title": "Business Lead"    },
            { "firstname": "Esme",      "lastname": "Brachmann","portrait": ""
                , "grade": 12, "title": "Treasurer"        },
            { "firstname": "Meredith",  "lastname": "Nash",     "portrait": ""
                , "grade": 10, "title": "Treasurer"        }
        ],
        "engineers": [
            { "firstname": "Connor",    "lastname": "Aitken",   "portrait": "", "grade": 12 },
            { "firstname": "Alton",     "lastname": "Shu",      "portrait": "", "grade": 11 },
            { "firstname": "Thomas",    "lastname": "Masterson","portrait": "", "grade": 11 },
            { "firstname": "Travis",    "lastname": "Ng",       "portrait": "", "grade": 12 },
            { "firstname": "Isabela",   "lastname": "Acenas",   "portrait": "", "grade": 10 },
            { "firstname": "Michelle",  "lastname": "Mak",      "portrait": "", "grade": 12 }
        ],
        "programmers": [
            { "firstname": "Peter",    "lastname": "Anders",    "portrait": "", "grade": 10 },
            { "firstname": "Fiona",    "lastname": "Zhao",      "portrait": "", "grade": 10 },
            { "firstname": "Peter",    "lastname": "Skidmore",  "portrait": "", "grade": 10 },
            { "firstname": "Maggie",   "lastname": "Chang",     "portrait": "", "grade": 10 },
            { "firstname": "Riley",    "lastname": "Woo",       "portrait": "", "grade": 12 },
            { "firstname": "Andrew",   "lastname": "Guan",      "portrait": "", "grade": 12 },
            { "firstname": "Reave",    "lastname": "Hosman",    "portrait": "", "grade": 12 },
            { "firstname": "Hyun June","lastname": "Gill",      "portrait": "", "grade": 12 },
            { "firstname": "Ethan",    "lastname": "Hsieh",     "portrait": "", "grade": 12 },
            { "firstname": "Jessica",  "lastname": "Cherny",    "portrait": "", "grade": 12 }
        ],
        "business": [
            { "firstname": "David",    "lastname": "Zhou",      "portrait": "", "grade": 11 },
            { "firstname": "Valerie",  "lastname": "Hon",       "portrait": "", "grade": 10 },
            { "firstname": "Dara",     "lastname": "Phung",     "portrait": "", "grade": 10 },
            { "firstname": "Sonia",    "lastname": "Varah",     "portrait": "", "grade": 10 }
        ]
    }
}