{
    "blogs": [
        {
            "header": "Thanks for checking in. We're currently working on the website-- please come back later!",
            "author": "Stanley Kwong",
            "team"  : "Webmaster",
            "date"  : ["2014", "6", "1"],
            "paragraphs" : [
                "We appreciate you checking out our website! However, you caught us at a bit of a bad time, because we're remaking the site! It's going to be pretty sweet, and so much better than the last one. So nothing on the website works right now. Sorry!"
            ],
            "images": []
        }
      , {
            "header": "Holiday Fundraiser",
            "author": "Christina Wade",
            "team"  : "Advisor",
            "date"  : ["2013", "12", "6"],
            "paragraphs" : [
                "Talk about spirit! The Iron Panthers brought the FTC robot to Burlingame's annual Tree Lighting Ceremony in order to show off the newly improved \"Rubicorn\" to the wider community.",
                "<img src=\"imgs/treelighting1.jpg\"><\/img>",
                "Kids and adults gathered around the table to gander at the mechanical beast that stood in front of them. Local politicians, choir groups, merchants, and vendors gather during the Tree Lighting Ceremony to celebrate the holidays and support the community.  We persevered, despite the rain, and received many compliments from community members.",
                "<img src=\"imgs/treelighting2.jpg\"><\/img>"
                
            ],
            "images": ["imgs/treelighting0.jpg"]
        }
      , {
            "header": "Bag and Tag Fundraiser",
            "author": "Christina Wade", 
            "team"  : "Advisor",
            "date"  : ["2014", "2", "21"],
            "paragraphs" : [
                "On February 20th, the Iron Panthers held their first annual Bag and Tag Fundraiser Dinner. We raised not only over $1000, but also awareness of and support for the team! Wow! Not too shabby for a rookie team! Guests were able to see demonstrations of both the FTC and the FRC robots, as well as watch the Chairman's Award video and Robot Release video as we unveiled the \"Deadliest Catch.\" We also presented a <a href=\"http://prezi.com/jkgenwbyud1w/burlingame-robotics-team/\">Prezi<\/a> detailing our journey thus far.",
                "<img src=\"imgs/bagandtag1.jpg\" alt=\"Dinner presentations\"><\/img>",
                "After a dinner provided by Iron Panther chefs and local businesses such as Crepevine, some guests were able to drive the FTC robot, raising the flag and hanging from the pull-up bar. Aside from Iron Panthers families and BHS teachers, major community members also attended, including Burlingame mayor Michael Brownrigg."
            ],
            "images": ["imgs/bagandtag0.jpg"]
        }
      , {
            "header": "Blocks don't matter: points do.",
            "author": "Cuyler Crandall",
            "team"  : "Engineering Lead",
            "date"  : ["2014", "8", "7"],
            "paragraphs"  : [
                "Our first season of FTC was rough around the edges but ultimately a challenging and insightful experience for our team. As a rookie team we fell victim to numerous traps in our design and building process, leading us to waste time and resources on designs which ultimately failed or never came to be. In our first robot we went for the obvious method of scoring points: lifting blocks into the baskets, while we dismissed the pull up bar as an impossibility for our new team and only gave the flag turner a brief afterthought. The robot, when “complete,” was little better than a prototype. The drive base was simple but effective, however everything piled haphazardly on top of it was laughably useless. Our block scoring mechanism was made of wood for lack of metal parts, our flag turner was a Mindstorms motor, and our robot was held together by its string suspension system. Our first competition, the FTC qualifier at Saratoga High School, we fell apart. Literally: the robot was in pieces, the competition had been Murphy’s Law at it’s finest.",
                "After the competition we were in shock, but after a few days we came to and set at work to rebuild a better robot. Over Thanksgiving break we sat in one of our team leads’ living room and decided upon major points: points were our goal as opposed to blocks, we needed more parts to have any hope of being competitive, and that accepting that our first robot had failed was important in us moving on to the next robot. In the weeks following that meeting we crunched and were able to build our second robot, just barely in time for our second qualifier at Valley Christian High School. Our second robot was the antithesis of our first: where the first had been a blind attempt to score block points, our second was a sleek, barebones robot which aimed to score as many points as we could while still allowing us to build it in under a month. Our second robot virtually ignored the baskets and blocks, aiming to score as many peripheral points as possible (50 from hanging, 35 from the flag, 20 for being on the ramp at the end of autonomous, and finally 20\/40 from a blindly dumped autonomous block).",
                "The robot was an unprecedented success, although kinks in the design held us back in the standings, we obtained the highest block scores in each competition which we competed at. Sadly, we were too little, too late and were unable to qualify for the next level of FTC competition. What we did learn from the two robots was the importance in timing, a robot which could grab all of the “difficult” points during the first qualifier would be enough to qualify for the next round, but by building it for our second competition it wasn’t enough to compete with the more complex “do-it-all” robots. Next year one of our biggest goals will be to build a robot which is designed to maximize points scored first, and only after we have that robot working will we either build a second robot or improve the first in order to address all elements of the game. Doing so should allow us to qualify for the next level of FTC, and lead to competitive season for our robots and team."
            ],
            "images": ["imgs/ftcrobot1sharpened.jpg"]
        }
      , {
            "header": "Check out the new E-Blog!",
            "author": "Leon Cheung",
            "team"  : "Webmaster",
            "date"  : ["2014", "12", "12"],
            "paragraphs" : [
                "Starting January 3rd, the engineering and programming teams will be posting frequently to the E-Blog about updates on our robot design, build, and code. Check often for updates during the new FRC 2015 season! The E-Blog is located conveniently in the navigation bar at the top of the page."
            ],
            "images": ["imgs/calgames1.jpg"]
        }
      , {
            "header": "Movie Night Fundraiser",
            "author": "Leon Cheung",
            "team"  : "Webmaster",
            "date"  : ["2014", "12", "12"],
            "paragraphs" : [
                "As part of our continued fundraising effort to raise money for competition registration fees and robot components, the Iron Panthers hosted a community movie night. Children gathered around to have fun watching Elf and eating pizza. We plan to hold another similar fundraiser near Valentine's Day to meet part of our goal to register for the FRC regionals held at UC Davis, in addition to the regionals at San Jose State University, both of which we will attend early next year."
            ],
            "images": ["imgs/fundraisermovie.jpg"]
        }
      , {
            "header": "The Iron Panthers Wins Two FTC Awards",
            "author": "Leon Cheung",
            "team"  : "Webmaster",
            "date"  : ["2014", "12", "13"],
            "paragraphs" : [
                "The Iron Panthers have been busy designing robots for the FTC 2014 season, where the main objectives revolve around scoring wiffle-balls into tall, mobile, and cylindrical goals. Although our robot was crippled the by untimely delivery of robot parts, we still have excelled in the other parts of being a FIRST team. Specifically, at the Redwood City Qualifier Tournament held on November 22nd, 2014, we were graciously awarded the <a href=\"http:\/\/www.usfirst.org\/roboticsprograms\/ftc\/think\">Think Award<\/a> for demonstrating Gracious Professionalism and submitting an in-depth engineering notebook. The content on engineering notebook is not unlike that which will be posted to the E-Blog on this website, so be sure to check out the quality material.",
                "<img src=\"imgs/ftcaward0.jpg\" alt=\"FTC Think Award\"><\/img>",
                "Today, December 13th, 2014, at the FTC Qualifiers at the Play Space in San Jose, we won another award, this time, the <a href=\"http:\/\/www.usfirst.org\/roboticsprograms\/ftc\/connect\">Connect Award<\/a>, which is awarded to teams that have significant community outreach programs. This award does not serve as proof, but confirmation of our superb community involvement in the form of fundraisers and community awareness, which raises the importance of STEM programs in the Burlingame community.",
                "<img src=\"imgs/ftcaward1.jpg\" alt=\"FTC Connect Award\"><\/img>",
                "Please do keep in mind that the Iron Panthers is still looking for support from the community in the form of donations that will help us pay for robot materials and registration for the upcoming FRC 2015 season, during which we will participate in two regional qualifiers, the Silicon Valley Regionals, and the Davis Regionals."
            ],
            "images": ["imgs/ftcaward2.jpg"]
        }
      , {
            "header": "Recycle Rush Kickoff at Woodside High School",
            "author": "Morgan Ome",
            "team"  : "Business Lead",
            "date"  : ["2015", "1", "4"],
            "paragraphs" : [
                "As the rest of the world slept beneath a dense blanket of Bay Area fog, the Iron Panthers abandoned their warm beds to go to Woodside High School for the 2015 FRC Season Kickoff. The robotics community at large had been eagerly anticipating the highly secretive FRC Challenge, and after a long build up, were thrilled at the release of Recycle Rush.",
                "The Iron Panthers in conjunction with Woodside and Carlmont High Schools’ team, the Wild Hats, hosted Kickoff. Ten local teams from around the Bay Area attended. Together, the students mingled and talked, discussed and shared as the new challenge was unveiled. Following the broadcast of Recycle Rush, members of BHS and the Wild Hats led breakout discussion groups in which students shared possible strategies, asked questions, and brainstormed ideas for methods of approaching this year’s challenge. Some of the groups included Offensive Strategy, Scouting, Autonomous Strategy, and Points.",
                "The Iron Panthers were honored to help the Wild Hats host Kickoff and look forward to a incredible, albeit busy season."
            ],
            "images": ["imgs/frcrrkickoff0.jpg"]
        }
      , {
            "header": "Students from team complete in local hackathon HSHacks",
            "author": "Leon Cheung",
            "team"  : "Webmaster",
            "date"  : ["2015", "2", "9"],
            "paragraphs" : [
                "At the PayPal headquarters in San Jose, programmers Max C, Leon Cheung, Peter Skidmore, and Austin Soohoo worked through the night to complete the project they call Gyst.",
                "According to Max,",
                "\"What we did at the hackathon was a cool little project. In the Burlingame robotics programming team we use a website or a service called Asana. In Asana we can assign each other tasks and assignments. So we came up an idea to make a homemade Asana. It was going well until we realized that we had to build a library to make it work. In the end we did not really care if it worked or not. The reason why we went on the hackathon was because its a great learning experience. That's what really matters in the end.\"",
                "Pronounced as \"geist\", it integrates together task management and the code base, allowing task creators and commenters to make inline references to relevant source code.",
                "If you're interested in the code, it can be found on <a href=\"https://github.com/ptskidmore/Gyst\">GitHub</a>."
            ],
            "images": ["imgs/hackathon.jpg"]
        }
      , {
            "header": "Presentation, dinner, and more at our Bag and Tag Dinner 2015!",
            "author": "Christina Wade",
            "team"  : "Webmaster",
            "date"  : ["2015", "3", "5"],
            "paragraphs" : [
                "Tomorrow is our Bag and Tag Fundraising Dinner!!!! Come on by for good food and to see our robot. We will be having a silent auction with items donated to us from local businesses including Gap, David's Tea and Books Inc. There will also be a GoPro Camera and accessories up for auction as well as other surprise items!!!!"
            ],
            "images": ["imgs/frcbagandtag2015invitation.png"]
        }    
      , {
            "header": "The Iron Panthers at the Sacramento and Silicon Valley Regionals",
            "author": "Sami Solow",
            "team"  : "Business",
            "date"  : ["2015", "4", "29"],
            "paragraphs" : [
                "From Thursday, April 2nd to Saturday, April 4th, the Burlingame Iron Panthers competed in our second competition at the FRC Silicon Valley Regional. We, along with 57 other teams, took part in the challenge called Recycle Rush, where robots of all different designs stacked recycling totes and containers for points. After some additions to the robot, our team was very successful at the competition, and our alliance placed 3rd overall!",
                "After competing at the first regional the Iron Panthers competed in, the Sacramento Regional, a few changes were made to the robot so that it was able to grab recycling containers from the middle of the field during the autonomous (pre-programmed function) period. This function of the robot was something other robots did not have and while the robot was not as efficient at stacking totes, this specific aspect of the robot made it very useful to teams that needed the containers.",
                "Because our robot was able to pull in the recycling containers so quickly at the beginning of the match we were selected by the third-seeded alliance.  Our new alliance partners were the Funky Monkeys (team 846) and Team Kika Mana (team 368) all the way from Hawaii!  We were thrilled to get picked, and we knew we had a good chance going into the matches.  Our alliance did an amazing job in the elimination matches, and we made it to the semi-finals. Unfortunately, we were unable to beat the top two-seeded alliances due to some technical issues, but we placed third overall!  It was so exciting for our team to place so well after a tough competition at the Sacramento Regional.  For a second year team we are extremely proud of what we have accomplished, and we are so excited to challenge ourselves in the years to come!"
            ],
            "images": ["imgs/frcsvr0.jpg"]
        }
    ],
    
    "members": {
        "mentors" : [
            { "firstname": "Christina", "lastname": "Wade",     "portrait": "" },
            { "firstname": "Ian",       "lastname": "Hovander", "portrait": "" },
            { "firstname": "Parker",    "lastname": "Robinson", "portrait": "" },
            { "firstname": "Dennis",    "lastname": "Millstein","portrait": "" }
        ],
        "leads": [
            { "firstname": "Sami",      "lastname": "Solow",    "portrait": ""
                , "grade": 12, "title": "Team Captain"     },
            { "firstname": "Cameron",   "lastname": "Chen",     "portrait": ""
                , "grade": 12, "title": "Team Captain"     },
            { "firstname": "Reuben",    "lastname": "Grossman", "portrait": ""
                , "grade": 11, "title": "Engineering Lead" },
            { "firstname": "Cuyler",    "lastname": "Crandall", "portrait": ""
                , "grade": 11, "title": "Engineering Lead" },
            { "firstname": "Connor",    "lastname": "Aitken",   "portrait": ""
                , "grade": 12, "title": "Engineering Lead" },    
            { "firstname": "Leon",      "lastname": "Cheung",   "portrait": ""
                , "grade": 12, "title": "Programming Lead" },
            { "firstname": "Peter",     "lastname": "Skidmore", "portrait": ""
                , "grade": 11, "title": "Programming Lead" },
            { "firstname": "Morgan",    "lastname": "Ome",      "portrait": ""
                , "grade": 12, "title": "Business Lead"    },
            { "firstname": "Gracie",    "lastname": "Kober",    "portrait": ""
                , "grade": 10, "title": "Business Lead"    },
            { "firstname": "Meredith",  "lastname": "Nash",     "portrait": ""
                , "grade": 10, "title": "Treasurer"        }
        ],
        "engineers": [
            { "firstname": "Alton",     "lastname": "Shu",      "portrait": "", "grade": 11 },
            { "firstname": "Thomas",    "lastname": "Masterson","portrait": "", "grade": 11 },
            { "firstname": "Lucy",      "lastname": "Cummings", "portrait": "", "grade": 11 },
            { "firstname": "Stella",    "lastname": "Yang",     "portrait": "", "grade": 9  },
            { "firstname": "Jackson",   "lastname": "Gravagno", "portrait": "", "grade": 9  },
            { "firstname": "Jason",     "lastname": "Fong",     "portrait": "", "grade": 9  },
            { "firstname": "Rory",      "lastname": "Douglass", "portrait": "", "grade": 9  },
            { "firstname": "Kyle",      "lastname": "Doran",    "portrait": "", "grade": 9  },
            { "firstname": "William",   "lastname": "Kjærulff-Jørgensen","portrait": "", "grade": 11  },
            { "firstname": "Jared",     "lastname": "Birmingham","portrait": "", "grade": 9 }
        ],
        "programmers": [
            { "firstname": "Max",      "lastname": "Chakhmatov","portrait": "", "grade": 11 },
            { "firstname": "Chase",    "lastname": "Maramgu",   "portrait": "", "grade": 9  },
            { "firstname": "Isabel",   "lastname": "Dominik",   "portrait": "", "grade": 9  },
            { "firstname": "Austin",   "lastname": "Soohoo",    "portrait": "", "grade": 9  }
        ],
        "business": [
            { "firstname": "David",    "lastname": "Zhou",      "portrait": "", "grade": 11 },
            { "firstname": "Tegan",    "lastname": "Alberts",   "portrait": "", "grade": 9  },
            { "firstname": "Caroline", "lastname": "Pease",     "portrait": "", "grade": 9  },
            { "firstname": "Carolyn",  "lastname": "Tang",      "portrait": "", "grade": 9  },
            { "firstname": "Mary",     "lastname": "Perez",     "portrait": "", "grade": 11 },
            { "firstname": "Kevin",    "lastname": "Taggart",   "portrait": "", "grade": 9  }
        ]
    }
}